# Pandas puzzles

Most the following exercises have been selected by UZH ZI & David Pinezich as part of the ZI APPD course. Inspired by [100 Numpy exerises](https://github.com/rougier/numpy-100), here is a short list of puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power. 

Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating), making use of the core DataFrame and Series objects. 

Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy). Choosing the right methods and following best practices is the underlying goal.

If you're just starting out with pandas and you are looking for some other resources, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Enjoy!

## Importing pandas

### Getting started and checking your pandas setup

**1.** Import pandas under the name `pd`, and numpy under its alias `np`.

In [2]:
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [3]:
pd.__version__

'2.3.3'

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

**3.** Load the data from `pd_puzzles.csv`. Assign the following list as indices: `['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']`.

In [4]:
df= pd.read_csv("pd_puzzles.csv")
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

**4.** Display the basic information about this DataFrame and its data.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 452.0+ bytes

**5.** Display the summary statistics about the data in the df.

In [6]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**6.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [12]:
df.loc[:,["age","animal"]]

   age animal
0  2.5    cat
1  3.0    cat
2  0.5  snake
3  NaN    dog
4  5.0    dog
5  2.0    cat
6  4.5  snake
7  NaN    cat
8  7.0    dog
9  3.0    dog

**7.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.
(**hint**: df.index)

In [15]:
df.loc[df.index[[3,4,8]],["age","animal"]]

   age animal
3  NaN    dog
4  5.0    dog
8  7.0    dog

**8.** Select only the rows where the number of visits is greater than 2.

In [17]:
df[df["visits"]>2]

  animal  age  visits priority
1    cat  3.0       3      yes
3    dog  NaN       3      yes
5    cat  2.0       3       no

**9.** Select the rows where the age is missing, i.e. is `NaN`.
(**hint**: isna)

In [18]:
df[df.isna()]

  animal  age  visits priority
0    NaN  NaN     NaN      NaN
1    NaN  NaN     NaN      NaN
2    NaN  NaN     NaN      NaN
3    NaN  NaN     NaN      NaN
4    NaN  NaN     NaN      NaN
5    NaN  NaN     NaN      NaN
6    NaN  NaN     NaN      NaN
7    NaN  NaN     NaN      NaN
8    NaN  NaN     NaN      NaN
9    NaN  NaN     NaN      NaN

**10.** Select the rows where the animal is a cat *and* the age is less than 3.

In [25]:
df[(df["animal"] == "cat") & (df["age"] < 3)]

  animal  age  visits priority
0    cat  2.5       1      yes
5    cat  2.0       3       no

**11.** Change the age of the cat in row 'd' to 5.5. (**hint**: You can use both implicit or explicit indices)

In [41]:
df.loc[7, 'age'] = 5.5
df

  animal  age  visits priority
0    cat  2.5     1.0      yes
1    cat  3.0     3.0      yes
2  snake  0.5     2.0       no
3    dog  5.5     3.0      yes
4    dog  5.0     2.0       no
6  snake  4.5     1.0       no
7    cat  5.5     1.0      yes
8    dog  7.0     2.0       no
9    dog  3.0     1.0       no
5    NaN  5.5     NaN      NaN

**12.** Calculate the sum of all visits (the total number of visits).

In [44]:
df["visits"].sum()

np.float64(16.0)

**13.** Calculate the mean age for each different animal in `df`.

In [45]:
df.groupby("animal")["age"].mean()

animal
cat      3.666667
dog      5.125000
snake    2.500000
Name: age, dtype: float64

**14.** Append a new column 'newcol' to `df` with your choice of values for each column. Then delete that column to return the original DataFrame.

In [47]:
df["new_col"]=None

In [48]:
df

  animal  age  visits priority new_col
0    cat  2.5     1.0      yes    None
1    cat  3.0     3.0      yes    None
2  snake  0.5     2.0       no    None
3    dog  5.5     3.0      yes    None
4    dog  5.0     2.0       no    None
6  snake  4.5     1.0       no    None
7    cat  5.5     1.0      yes    None
8    dog  7.0     2.0       no    None
9    dog  3.0     1.0       no    None
5    NaN  5.5     NaN      NaN    None

In [52]:
df= df.drop(columns=["new_col"])

In [53]:
df

  animal  age  visits priority
0    cat  2.5     1.0      yes
1    cat  3.0     3.0      yes
2  snake  0.5     2.0       no
3    dog  5.5     3.0      yes
4    dog  5.0     2.0       no
6  snake  4.5     1.0       no
7    cat  5.5     1.0      yes
8    dog  7.0     2.0       no
9    dog  3.0     1.0       no
5    NaN  5.5     NaN      NaN

**15.** Append a new row to `df` for a 5 y.o. parrot on his second visit with no priority. Then delete that row again to return to the original DataFrame.

In [56]:
# Append a new row
new_row = {'animal': 'parrot', 'age': 5, 'visits': 2, 'priority': 'no'}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)
df

    animal  age  visits priority
0      cat  2.5     1.0      yes
1      cat  3.0     3.0      yes
2    snake  0.5     2.0       no
3      dog  5.5     3.0      yes
4      dog  5.0     2.0       no
5    snake  4.5     1.0       no
6      cat  5.5     1.0      yes
7      dog  7.0     2.0       no
8      dog  3.0     1.0       no
9      NaN  5.5     NaN      NaN
10  parrot  5.0     2.0       no
11  parrot  5.0     2.0       no

In [60]:

# Delete the last row to return to original
df = df.iloc[:-1]

In [61]:
df

  animal  age  visits priority
0    cat  2.5     1.0      yes
1    cat  3.0     3.0      yes
2  snake  0.5     2.0       no
3    dog  5.5     3.0      yes
4    dog  5.0     2.0       no
5  snake  4.5     1.0       no
6    cat  5.5     1.0      yes
7    dog  7.0     2.0       no
8    dog  3.0     1.0       no

**16.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [67]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, None, 5, 2, 4.5, None, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

df = pd.DataFrame(data)

In [68]:
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

In [69]:
df['priority'] = df['priority'].map({'yes': True, 'no': False})

In [70]:
df

  animal  age  visits  priority
0    cat  2.5       1      True
1    cat  3.0       3      True
2  snake  0.5       2     False
3    dog  NaN       3      True
4    dog  5.0       2     False
5    cat  2.0       3     False
6  snake  4.5       1     False
7    cat  NaN       1      True
8    dog  7.0       2     False
9    dog  3.0       1     False

**17.** In the 'animal' column, change the 'snake' entries to 'python'.

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order.

**19.** Create a copy of the animal column, delete all duplicated rows and add another column with the biological family (dogs = canidae, cats = felidae, python = pythonidea), then merge the copy with the original dataframe.

**20.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

**21.** Given a DataFrame of numeric values, say
```python
df2 = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

**22.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df2 = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? (Find that column's label.)

**23.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? What about unique entries in each columns?

Use the follwing dataframe:
```python
df_3 = pd.DataFrame({
    "A": [1, 1, 2, 2, 3, 3, 3],
    "B": [10, 10, 20, 20, 30, 31, 30],
    "C": ["x", "x", "y", "y", "z", "z", "z"]
})
```